Reminders/app/controllers/todo_lists_controller.rb

SELECT "todo_lists".* FROM "todo_lists"
---
  def index
    @todo_lists = TodoList.all

INSERT INTO "todo_lists" ("created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 12 Oct 2016 07:09:23 UTC +00:00], ["description", "this is my reminders app\r\n\r\n"], ["title", "Hey niggas"], ["updated_at", Wed, 12 Oct 2016 07:09:23 UTC +00:00]]
---
  def create
    @todo_list = TodoList.new(todo_list_params)

    respond_to do |format|
      if @todo_list.save

UPDATE "todo_lists" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "todo_lists"."id" = 1  [["title", "Hey People"], ["description", "This is my reminders app\r\n\r\n"], ["updated_at", Wed, 12 Oct 2016 09:02:19 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @todo_list.update(todo_list_params)

SELECT "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = ? LIMIT 1  [["id", "2"]]
---
    def set_todo_list
      @todo_list = TodoList.find(params[:id])