Reminders/app/controllers/todo_items_controller.rb

INSERT INTO "todo_items" ("content", "created_at", "todo_list_id", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Reminder Item"], ["created_at", Wed, 12 Oct 2016 07:11:46 UTC +00:00], ["todo_list_id", 1], ["updated_at", Wed, 12 Oct 2016 07:11:46 UTC +00:00]]
---
  def create
    @todo_item = @todo_list.todo_items.create(todo_item_params)

DELETE FROM "todo_items" WHERE "todo_items"."id" = ?  [["id", 2]]
---
  def destroy
    if @todo_item.destroy

UPDATE "todo_items" SET "completed_at" = ?, "updated_at" = ? WHERE "todo_items"."id" = 1  [["completed_at", 2016-10-12 12:58:41 +0530], ["updated_at", Wed, 12 Oct 2016 07:28:41 UTC +00:00]]
---
  def complete
    @todo_item.update_attribute(:completed_at, Time.now)

SELECT "todo_items".* FROM "todo_items" WHERE "todo_items"."todo_list_id" = ? AND "todo_items"."id" = ? LIMIT 1  [["todo_list_id", 1], ["id", "2"]]
---
  def set_todo_item
    @todo_item = @todo_list.todo_items.find(params[:id])